Мюнцкабинент_30/src/Documents/ПоступлениеВКоллекцию/ПоступлениеВКоллекцию.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПоступлениеВКоллекцию</name>
  <registerRecords>AccumulationRegister.ДвиженияМонет</registerRecords>
  <registerRecords>AccumulationRegister.ПоступлениеМонет</registerRecords>
  <registerRecords>AccumulationRegister.ДополнительныеРасходы</registerRecords>
  <attributes>
    <name>ТипЦены</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Коллекционер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НакладныеРасходы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НакладныеРасходыУвеличиваютСтоимость</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Коллекция</name>
    <type>
      <types>CatalogRef.Коллекции</types>
    </type>
  </attributes>
  <attributes>
    <name>РазличныеКоллекции</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоллекцииСтрокой</name>
    <comment>Для отображения в списках в какие коллекции поступило</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Список</name>
    <attributes>
      <name>Монета</name>
      <type>
        <types>CatalogRef.Монеты</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Издержки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Коллекция</name>
      <type>
        <types>CatalogRef.Коллекции</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Мюнцкабинент_30/src/AccumulationRegisters/ДвиженияМонет/ДвиженияМонет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДвиженияМонет</name>
  <comment>Приходные и расходные операции с монетами</comment>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Стоимость</name>
    <comment>Фактически себестоимость единицы</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Монеты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Коллекция</name>
    <type>
      <types>CatalogRef.Коллекции</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Мюнцкабинент_30/src/AccumulationRegisters/ПоступлениеМонет/ПоступлениеМонет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ПоступлениеМонет</name>
  <registerType>Turnovers</registerType>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВалютнаяСумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Монеты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Коллекция</name>
    <type>
      <types>CatalogRef.Коллекции</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Мюнцкабинент_30/src/InformationRegisters/СтоимостьОбъектовКоллекцинирования/СтоимостьОбъектовКоллекцинирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтоимостьОбъектовКоллекцинирования</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>Стоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>РегистраторЦен</name>
    <type>
      <types>DocumentRef.Инвентаризация</types>
      <types>DocumentRef.ПоступлениеВКоллекцию</types>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.ВидыМонет</types>
      <types>CatalogRef.Монеты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипЦены</name>
    <type>
      <types>CatalogRef.ТипыЦен</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Мюнцкабинент_30/src/AccumulationRegisters/ДополнительныеРасходы/ДополнительныеРасходы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДополнительныеРасходы</name>
  <comment>Дополнительные расходы: стоимость приобретения альбомов, холдеров и проч.</comment>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Коллекционер</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Мюнцкабинент_30/src/Documents/ПоступлениеВКоллекцию/ObjectModule.bsl
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если НЕ ЗначениеЗаполнено(Коллекционер) Тогда
		Коллекционер = ПараметрыСеанса.ТекущийПользователь;
	КонецЕсли;	
	
	СуммаДокумента = Список.Итог("Сумма");
	//
	КоллекцииСтрокой = СформироватьСписокКоллекций ();
	//
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	
	// регистр ДвиженияМонет Приход
	Движения.ДвиженияМонет.Записывать = Истина;
	Для Каждого ТекСтрокаСписок Из Список Цикл
		Движение 				= Движения.ДвиженияМонет.Добавить();
		Движение.ВидДвижения 	= ВидДвиженияНакопления.Приход;
		Движение.Период 		= Дата;
		Движение.Объект 		= ТекСтрокаСписок.Монета;
		Движение.Коллекция		= ?(РазличныеКоллекции, ТекСтрокаСписок.Коллекция, Коллекция);
		Движение.Количество		= ?(ТекСтрокаСписок.Количество > 0, ТекСтрокаСписок.Количество, 1);
		Движение.Стоимость		= ?(Движение.Количество <> 0, ТекСтрокаСписок.Сумма / Движение.Количество, ТекСтрокаСписок.Сумма);
	КонецЦикла;
	//
	// регистр Поступление монет
	Движения.ПоступлениеМонет.Записывать	= Истина;
	Для Каждого ТекСтрокаСписок Из Список Цикл
		Движение 				= Движения.ПоступлениеМонет.Добавить();
		Движение.Период 		= Дата;
		Движение.Объект 		= ТекСтрокаСписок.Монета;
		Движение.Валюта 		= ТипЦены.Валюта;
		Движение.Коллекция		= ?(РазличныеКоллекции, ТекСтрокаСписок.Коллекция, Коллекция);
		Движение.Количество		= ?(ТекСтрокаСписок.Количество > 0, ТекСтрокаСписок.Количество, 1);
		Движение.Сумма 			= ТекСтрокаСписок.Сумма;
	КонецЦикла;	
	//
	РегистрыСведений.СтоимостьОбъектовКоллекцинирования.УдалитьЗаписиПоРегистраторуЦен(Ссылка);
	
	// регистр СтоимостьОбъектовКоллекцинирования
	Для Каждого Строка Из Список Цикл
		МЗ = РегистрыСведений.СтоимостьОбъектовКоллекцинирования.СоздатьМенеджерЗаписи();
		МЗ.Период				= Дата;
		МЗ.Объект 				= Строка.Монета;
		МЗ.ТипЦены				= ТипЦены;
		МЗ.Стоимость			= ?(Строка.Количество <> 0, Строка.Сумма/Строка.Количество, Строка.Сумма);
		МЗ.РегистраторЦен		= Ссылка;
		МЗ.Записать();
	КонецЦикла;	
	
	// регистр ДополнительныеРасходы Приход
	Если (НЕ НакладныеРасходыУвеличиваютСтоимость) И (НакладныеРасходы <> 0) Тогда
		// если накладные расходы не учитываются в стоимости монет, то просто учтем их как доп. расходы
		
		Движения.ДополнительныеРасходы.Записывать = Истина;
		Движение = Движения.ДополнительныеРасходы.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Коллекционер = Коллекционер;
		Движение.Сумма = НакладныеРасходы;
		
	КонецЕсли;	
	
	
	
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ПроверяемыеРеквизиты.Найти ("ТипЦены") = Неопределено Тогда
		ПроверяемыеРеквизиты.Добавить ("ТипЦены")	
	КонецЕсли;	
КонецПроцедуры

Функция СформироватьСписокКоллекций () Экспорт
	Если Не РазличныеКоллекции Тогда
		Возврат СокрЛП(Коллекция.Наименование);
	Иначе
		ТмпТЗ = Список.Выгрузить(, "Коллекция");
		ТмпТЗ.Свернуть("Коллекция", "");
		ТмпСтр = "";
		Для Каждого Строка ИЗ ТмпТЗ Цикл
			ТмпСтр = ?(ПустаяСтрока(ТмпСтр), "", ТмпСтр + "; ") + СокрЛП(Строка.Коллекция.Наименование) 
		КонецЦикла;	
		Возврат ТмпСтр 
	КонецЕсли;	
КонецФункции
